%% 测试高斯消去法解方程组
A = [7, 8, 11;
    5, 1, -3;
    1, 2, 3];
b = [-3;
    -4;
    1];
format rat;
x = GaussElim(A, b);

%% 测试高斯列主元消去法解方程组
A = [1, 2, 1;
    2, 2, 3;
    -1, -3, 0];
b = [0;
    3;
    2];
format rat;
x = GaussElimPivot(A, b);

%% 测试LU分解法解方程组
A = [3, 2, 5;
    -1, 4, 3;
    1, -1, 3];
b = [6;
    5;
    1];
format rat;
[x, L, U] = LU(A, b);

%% 测试雅克比迭代法解方程组
A = [8, -3, 2;
    4, 11, -1;
    6, 3, 12];
b = [20;
    33;
    36];
x0 = [0, 0, 0];
x = JacobiSolver(A, b, x0);

%% 测试高斯-赛德尔迭代法解方程组
A = [8, -3, 2;
    4, 11, -1;
    6, 3, 12];
b = [20;
    33;
    36];
x0 = [0, 0, 0];
x = GaussSeidel(A, b, x0);

%% 测试逐次超松弛迭代法解方程组
A = [-4, 1, 1, 1;
    1, -4, 1, 1;
    1, 1, -4, 1;
    1, 1, 1, -4];
b = [1;
    1;
    1;
    1];
x0 = [0, 0, 0, 0];
omega = 1.3;
x = SOR(A, b, x0, omega);
